src/Catalogs/СОД_Регистрации/СОД_Регистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СОД_Регистрации</name>
  <attributes>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.СОД_Узлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаПодтверждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящееПодтверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящееПодтверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.СОД_НаправлениеРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетаКод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сеанс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалениеОбъекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДвоичныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСообщения</name>
    <type>
      <types>EnumRef.СОД_ФорматыСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОтправлена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/СОД_Регистрации/Forms/ФормаУстановкиПризнакаДляУзла/Module.bsl
&НаСервере
Процедура УстановитьНаСервере()
	
	Если Не ЗначениеЗаполнено(Узел) Тогда
		СОД_Общий.СообщитьПользователю("Параметр [" + Узел + "] не задан или задан не верно.");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Направление) Тогда
		СОД_Общий.СообщитьПользователю("Параметр [" + Направление + "] не задан или задан не верно.");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Узел", Узел);
	Запрос.УстановитьПараметр("Направление", Направление);
	Запрос.УстановитьПараметр("Отправлено", Отправлено);
	Запрос.УстановитьПараметр("Обработано", Обработано);
	Запрос.УстановитьПараметр("ОбработкаПодтверждена", ОбработкаПодтверждена);
	Запрос.УстановитьПараметр("ИсходящееПодтверждение", ИсходящееПодтверждение);
	Запрос.УстановитьПараметр("ВходящееПодтверждение", ВходящееПодтверждение);
	Запрос.УстановитьПараметр("ВходящаяРегистрация", ВходящаяРегистрация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СОД_Регистрации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СОД_Регистрации КАК СОД_Регистрации
	               |ГДЕ
	               |	(
				   |	    (СОД_Регистрации.Отправлено 				= ЛОЖЬ) И &Отправлено ИЛИ &ВходящаяРегистрация
	               |	ИЛИ (СОД_Регистрации.Обработано 				= ЛОЖЬ) И &Обработано
	               |	ИЛИ (СОД_Регистрации.ОбработкаПодтверждена 		= ЛОЖЬ) И &ОбработкаПодтверждена
	               |	ИЛИ (СОД_Регистрации.ИсходящееПодтверждение 	= ЛОЖЬ) И &ИсходящееПодтверждение
	               |	ИЛИ (СОД_Регистрации.ВходящееПодтверждение 		= ЛОЖЬ) И &ВходящееПодтверждение
				   |    )
	               |	И СОД_Регистрации.Направление   = &Направление
				   |	И СОД_Регистрации.Узел			= &Узел";
	
	РегистрацииКОбработке = Запрос.Выполнить().Выгрузить()
								.ВыгрузитьКолонку("Ссылка");
								
	Для Каждого РегистрацияСсылка Из РегистрацииКОбработке Цикл
									
		Попытка
			
			РегистрацияОбъект = РегистрацияСсылка.ПолучитьОбъект();
			
			РегистрацияОбъект.Отправлено 				= ?(Отправлено, Истина, РегистрацияОбъект.Отправлено);
			РегистрацияОбъект.Обработано 				= ?(Обработано, Истина, РегистрацияОбъект.Обработано);
			РегистрацияОбъект.ОбработкаПодтверждена 	= ?(ОбработкаПодтверждена, Истина, РегистрацияОбъект.ОбработкаПодтверждена);
			РегистрацияОбъект.ИсходящееПодтверждение 	= ?(ИсходящееПодтверждение, Истина, РегистрацияОбъект.ИсходящееПодтверждение);
			РегистрацияОбъект.ВходящееПодтверждение 	= ?(ВходящееПодтверждение, Истина, РегистрацияОбъект.ВходящееПодтверждение);
			
			РегистрацияОбъект.Записать();
			
		Исключение
			
			Ошибка = ОписаниеОшибки();
			
			Текст = "Не удалось записать регистрацию: " + РегистрацияСсылка + Символы.ПС
				  + Ошибка;
							
			СОД_Общий.СообщитьПользователю(Текст);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	УстановитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеПриИзменении(Элемент)
	
	ВходящаяРегистрация = Направление = ПредопределенноеЗначение("Перечисление.СОД_НаправлениеРегистрации.Входящее");
	
	Отправлено = ? (ВходящаяРегистрация, Ложь, Отправлено);
	Элементы.Отправлено.Доступность = Не ВходящаяРегистрация;
	
КонецПроцедуры
